Revit 2022 API
AnalyticalModelColumn.BaseExtensionPlaneId Property
 The bottom extension plane ID option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2015
Syntax
C#
public ElementId BaseExtensionPlaneId { get; set; }
Visual Basic
Public Property BaseExtensionPlaneId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ BaseExtensionPlaneId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 This Plane identifies a Level, a Grid, or a Ref Plane. To validate plane use [!:Autodesk::Revit::DB::Structure::AnalyticalModelColumn::isPlaneValidForExtension] method.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AnalyticalModelColumn Class
Autodesk.Revit.DB.Structure Namespace